Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.52/edc/ATSAMR21E16A.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="ATSAMR21E16A" edc:arch="arm32bit" edc:procid="0x0000" atdf:architecture="CORTEX-M0PLUS" atdf:family="SAMR" edc:hasFreeze="false" edc:atsamname="ATSAMR21E16A">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="1.8" edc:maxvoltage="3.6" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true">
    <edc:ProgrammingRowSize edc:progop="rowerase" edc:nzsize="256"/>
  </edc:Programming>
  <edc:ArchDef edc:name="arm32bit" edc:desc="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv6m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="-15" edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset"/>
    <edc:Interrupt edc:irq="-14" edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted"/>
    <edc:Interrupt edc:irq="-13" edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault"/>
    <edc:Interrupt edc:irq="-5" edc:cname="SVCall" edc:desc="System Service Call via SVC instruction"/>
    <edc:Interrupt edc:irq="-2" edc:cname="PendSV" edc:desc="Pendable request for system service"/>
    <edc:Interrupt edc:irq="-1" edc:cname="SysTick" edc:desc="System Tick Timer"/>
    <edc:Interrupt edc:irq="0" edc:cname="PM" edc:desc="Power Manager" ltx:memberofperipheral="PM"/>
    <edc:Interrupt edc:irq="1" edc:cname="SYSCTRL" edc:desc="System Controller" ltx:memberofperipheral="SYSCTRL"/>
    <edc:Interrupt edc:irq="2" edc:cname="WDT" edc:desc="Watchdog Timer" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:irq="3" edc:cname="RTC" edc:desc="Real Time Counter" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="4" edc:cname="EIC" edc:desc="External Interrupt Controller" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="5" edc:cname="NVMCTRL" edc:desc="Non-Volatile Memory Controller" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:irq="6" edc:cname="DMAC" edc:desc="Direct Memory Controller" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="7" edc:cname="USB" edc:desc="Universal Serial Bus" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="8" edc:cname="EVSYS" edc:desc="Event Systems" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="9" edc:cname="SERCOM0" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="10" edc:cname="SERCOM1" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="11" edc:cname="SERCOM2" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="12" edc:cname="SERCOM3" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="13" edc:cname="SERCOM4" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="14" edc:cname="SERCOM5" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="15" edc:cname="TCC0" edc:desc="Timer/Counter for Control Applications 0" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="16" edc:cname="TCC1" edc:desc="Timer/Counter for Control Applications 1" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="17" edc:cname="TCC2" edc:desc="Timer/Counter for Control Applications 2" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="18" edc:cname="TC3" edc:desc="Timer/Counter 3" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="19" edc:cname="TC4" edc:desc="Timer/Counter 4" ltx:memberofperipheral="TC4"/>
    <edc:Interrupt edc:irq="20" edc:cname="TC5" edc:desc="Timer/Counter 5" ltx:memberofperipheral="TC5"/>
    <edc:Interrupt edc:irq="23" edc:cname="ADC" edc:desc="Analog-to-Digital Converter" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:irq="24" edc:cname="AC" edc:desc="Analog Comparators" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:irq="26" edc:cname="PTC" edc:desc="Peripheral Touch Controller" ltx:memberofperipheral="PTC"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="SBMATRIX" edc:desc=""/>
    <edc:Peripheral edc:cname="MTB" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC0" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC1" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC2" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RFCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SYSCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TC4" edc:desc=""/>
    <edc:Peripheral edc:cname="TC5" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R7" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="28"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R8" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="32"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R9" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="36"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R10" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="40"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R11" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="44"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R12" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="48"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="SP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Stack Pointer" edc:nmmrid="52"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer" edc:nmmrid="64"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer" edc:nmmrid="68"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="LR" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:desc="Link Register" edc:nmmrid="56"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PC" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Program Counter" edc:nmmrid="60"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSR" edc:impl="0xF100003F" edc:access="nnnn---n------------------nnnnnn" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Program Status Register" edc:nmmrid="72"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="APSR" edc:impl="0xF0000000" edc:access="nnnn----------------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Application Program Status Register" edc:nmmrid="76"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="IPSR" edc:impl="0x3F" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Interrupt Program Status Register" edc:nmmrid="80"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="EPSR" edc:impl="0x1000000" edc:access="-------r------------------------" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Execution Program Status Register" edc:nmmrid="84"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register" edc:nmmrid="88"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL" edc:impl="0x3" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register" edc:nmmrid="100"/>
    </edc:NMMRPlace>
    <edc:CodeSector edc:regionid="IFLASH" edc:beginaddr="0x0" edc:endaddr="0x10000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:UserZone edc:regionid="USER_PAGE" edc:beginaddr="0x804000" edc:endaddr="0x804100" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:ConfigFuseSector edc:regionid="fuses" edc:beginaddr="0x804000" edc:endaddr="0x804008" atdf:pagesize="0x40">
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_0" edc:nzwidth="0x20" edc:impl="0xFE01FF77" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="nnnnnnn--------nnnnnnnnn-nnn-nnn" edc:_addr="0x804000" edc:default="0x0">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NVMCTRL_BOOTPROT" edc:nzwidth="0x3" edc:desc="Bootloader Size">
              <edc:DCRFieldSemantic edc:cname="SIZE_0BYTES" edc:desc="0 Bytes" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_512BYTES" edc:desc="512 Bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_1024BYTES" edc:desc="1024 Bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_2048BYTES" edc:desc="2048 Bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_4096BYTES" edc:desc="4096 Bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_8192BYTES" edc:desc="8192 Bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_16384BYTES" edc:desc="16384 Bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_32768BYTES" edc:desc="32768 Bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_EEPROM_SIZE" edc:nzwidth="0x3" edc:desc="EEPROM Size">
              <edc:DCRFieldSemantic edc:cname="SIZE_0BYTES" edc:desc="0 Bytes" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_256BYTES" edc:desc="256 Bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_512BYTES" edc:desc="512 Bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_1024BYTES" edc:desc="1024 Bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_2048BYTES" edc:desc="2048 Bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_4096BYTES" edc:desc="4096 Bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_8192BYTES" edc:desc="8192 Bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SIZE_16384BYTES" edc:desc="16384 Bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOD33USERLEVEL" edc:nzwidth="0x6" edc:desc="BOD33 User Level"/>
            <edc:DCRFieldDef edc:cname="BOD33_EN" edc:nzwidth="0x1" edc:desc="BOD33 Enable">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="BOD33 is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="BOD33 is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD33_ACTION" edc:nzwidth="0x2" edc:desc="BOD33 Action">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="RESET" edc:desc="The BOD33 generates a reset" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="INTERRUPT" edc:desc="The BOD33 generates an interrupt" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:DCRFieldDef edc:cname="WDT_ENABLE" edc:nzwidth="0x1" edc:desc="WDT Enable">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="WDT is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="WDT is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_ALWAYSON" edc:nzwidth="0x1" edc:desc="WDT Always On">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="WDT is enabled and disabled through ENABLE bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="WDT is enabled and can only be disabled by a power-on reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_PER" edc:nzwidth="0x4" edc:desc="WDT Period">
              <edc:DCRFieldSemantic edc:cname="CYC8" edc:desc="8 clock cycles" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CYC16" edc:desc="16 clock cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CYC32" edc:desc="32 clock cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CYC64" edc:desc="64 clock cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="CYC128" edc:desc="128 clock cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="CYC256" edc:desc="256 clock cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="CYC512" edc:desc="512 clock cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="CYC1024" edc:desc="1024 clock cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="CYC2048" edc:desc="2048 clock cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="CYC4096" edc:desc="4096 clock cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="CYC8192" edc:desc="8192 clock cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="CYC16384" edc:desc="16384 clock cycles" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_WINDOW_0" edc:nzwidth="0x1" edc:desc="WDT Window bit 0">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_1" edc:nzwidth="0x20" edc:impl="0xFFFF01FF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="nnnnnnnnnnnnnnnn-------nnnnnnnnn" edc:_addr="0x804004" edc:default="0x0">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="WDT_WINDOW_1" edc:nzwidth="0x3" edc:desc="WDT Window bits 3:1"/>
            <edc:DCRFieldDef edc:cname="WDT_EWOFFSET" edc:nzwidth="0x4" edc:desc="WDT Early Warning Offset">
              <edc:DCRFieldSemantic edc:cname="CYC8" edc:desc="8 clock cycles" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CYC16" edc:desc="16 clock cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CYC32" edc:desc="32 clock cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CYC64" edc:desc="64 clock cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="CYC128" edc:desc="128 clock cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="CYC256" edc:desc="256 clock cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="CYC512" edc:desc="512 clock cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="CYC1024" edc:desc="1024 clock cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="CYC2048" edc:desc="2048 clock cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="CYC4096" edc:desc="4096 clock cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="CYC8192" edc:desc="8192 clock cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="CYC16384" edc:desc="16384 clock cycles" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_WEN" edc:nzwidth="0x1" edc:desc="WDT Window Mode Enable">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="WDT is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="WDT is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD33_HYST" edc:nzwidth="0x1" edc:desc="BOD33 Hysteresis">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="No Hysteresis" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Hysteresis Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_REGION_LOCKS" edc:nzwidth="0x10" edc:desc="NVM Region Locks"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
