Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.52/edc/ATSAMR21E16A.PIC
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42004009"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="SWTRIG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4200400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:nzwidth="0x1" edc:desc="ADC Conversion Flush"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="ADC Start Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4200400D"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="INPUTCTRL" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn---nnnnn---nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF1F1F" edc:_addr="0x42004010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x5" edc:desc="Positive Mux Input Selection">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="PIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="PIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="PIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="PIN8" edc:desc="ADC AIN8 Pin" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="PIN9" edc:desc="ADC AIN9 Pin" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="PIN10" edc:desc="ADC AIN10 Pin" edc:when="(field &amp; 0x1F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="PIN11" edc:desc="ADC AIN11 Pin" edc:when="(field &amp; 0x1F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="PIN12" edc:desc="ADC AIN12 Pin" edc:when="(field &amp; 0x1F) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="PIN13" edc:desc="ADC AIN13 Pin" edc:when="(field &amp; 0x1F) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="PIN14" edc:desc="ADC AIN14 Pin" edc:when="(field &amp; 0x1F) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="PIN15" edc:desc="ADC AIN15 Pin" edc:when="(field &amp; 0x1F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="PIN16" edc:desc="ADC AIN16 Pin" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="PIN17" edc:desc="ADC AIN17 Pin" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="PIN18" edc:desc="ADC AIN18 Pin" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="PIN19" edc:desc="ADC AIN19 Pin" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TEMP" edc:desc="Temperature Reference" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Bandgap Voltage" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDCOREVCC" edc:desc="1/4  Scaled Core Supply" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDIOVCC" edc:desc="1/4  Scaled I/O Supply" edc:when="(field &amp; 0x1F) == 0x1B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x5" edc:desc="Negative Mux Input Selection">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="PIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="PIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="PIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Internal Ground" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="IOGND" edc:desc="I/O Ground" edc:when="(field &amp; 0x1F) == 0x19"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="INPUTSCAN" edc:nzwidth="0x4" edc:desc="Number of Input Channels Included in Scan"/>
            <edc:SFRFieldDef edc:cname="INPUTOFFSET" edc:nzwidth="0x4" edc:desc="Positive Mux Setting Offset"/>
            <edc:SFRFieldDef edc:cname="GAIN" edc:nzwidth="0x4" edc:desc="Gain Factor Selection">
              <edc:SFRFieldSemantic edc:cname="1X" edc:desc="1x" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2X" edc:desc="2x" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="4X" edc:desc="4x" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8X" edc:desc="8x" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16X" edc:desc="16x" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="1/2x" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
