Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.52/edc/ATSAMR21E16A.PIC
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="HSOFC" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0x4100500A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="FLENC" edc:nzwidth="0x4" edc:desc="Frame Length Control"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FLENCE" edc:nzwidth="0x1" edc:desc="Frame Length Control Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="nn--nn--" edc:por="00000000" edc:mclr="00000000" edc:impl="0xCC" edc:addr="0x4100500C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINESTATE" edc:nzwidth="0x2" edc:desc="USB Line State Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="FNUM" edc:nzwidth="0x10" edc:access="--nnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FFF" edc:addr="0x41005010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:nzwidth="0x3" edc:desc="Micro Frame Number"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:nzwidth="0xB" edc:desc="Frame Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="FLENHIGH" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:addr="0x41005012">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="FLENHIGH" edc:nzwidth="0x8" edc:desc="Frame Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="------nnnnnnnn--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FC" edc:addr="0x41005014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSOF" edc:nzwidth="0x1" edc:desc="Host Start Of Frame Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="BUS Reset Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DNRSM" edc:nzwidth="0x1" edc:desc="DownStream to Device Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume from Device Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DCONN" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DDISC" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="------nnnnnnnn--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FC" edc:addr="0x41005018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSOF" edc:nzwidth="0x1" edc:desc="Host Start Of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="Bus Reset Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DNRSM" edc:nzwidth="0x1" edc:desc="DownStream to the Device Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume fromthe device Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DCONN" edc:nzwidth="0x1" edc:desc="Link Power Management Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DDISC" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="------nnnnnnnn--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FC" edc:addr="0x4100501C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSOF" edc:nzwidth="0x1" edc:desc="Host Start Of Frame"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="Bus Reset"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up"/>
            <edc:SFRFieldDef edc:cname="DNRSM" edc:nzwidth="0x1" edc:desc="Downstream"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume from the Device"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access"/>
            <edc:SFRFieldDef edc:cname="DCONN" edc:nzwidth="0x1" edc:desc="Device Connection"/>
            <edc:SFRFieldDef edc:cname="DDISC" edc:nzwidth="0x1" edc:desc="Device Disconnection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PINTSMRY" edc:nzwidth="0x10" edc:access="--------rrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF" edc:addr="0x41005020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPINT0" edc:nzwidth="0x1" edc:desc="Pipe 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT1" edc:nzwidth="0x1" edc:desc="Pipe 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT2" edc:nzwidth="0x1" edc:desc="Pipe 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT3" edc:nzwidth="0x1" edc:desc="Pipe 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT4" edc:nzwidth="0x1" edc:desc="Pipe 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT5" edc:nzwidth="0x1" edc:desc="Pipe 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT6" edc:nzwidth="0x1" edc:desc="Pipe 6 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT7" edc:nzwidth="0x1" edc:desc="Pipe 7 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PCFG0" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:addr="0x41005100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token"/>
            <edc:SFRFieldDef edc:cname="BK" edc:nzwidth="0x1" edc:desc="Pipe Bank"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x3" edc:desc="Pipe Type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="BINTERVAL0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x41005103">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="BITINTERVAL" edc:nzwidth="0x8" edc:desc="Bit Interval"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PSTATUSCLR0" edc:nzwidth="0x8" edc:access="ww-w-w-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:addr="0x41005104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:nzwidth="0x1" edc:desc="Data Toggle clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Curren Bank clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Clear"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PSTATUSSET0" edc:nzwidth="0x8" edc:access="ww-w-w-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:addr="0x41005105">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:nzwidth="0x1" edc:desc="Data Toggle Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Set"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
